#pragma once
//==============================================================
// Подключённые библиотеки
//==============================================================
#include <string>
//==============================================================
// Подключённые namespace пространства
//==============================================================
using namespace std;

//==============================================================
// Описание класса
//==============================================================
class Book
{
	public:
		// Конструкторы
		Book();
		Book(int id_book, string name, string authors, string creation_data, string release_data, string content, int count_page);
		Book(string name, string authors, string creation_data, string release_data, string content, int count_page);

		// ---------------------------------------------------------------------------
		//	Интерфейсные методы
		// ---------------------------------------------------------------------------
		//============================================================================
		// 1) Изменения значений
		//============================================================================

			//	Метод позволяющий задать значение параметру _id_book		
			void set_id_book(int id_book);
			//	Метод позволяющий задать значение параметру	_name			
			void set_name(string name);
			//	Метод позволяющий задать значение параметру	_authors		
			void set_authors(string authors);
			//	Метод позволяющий задать значение параметру	_creation_data	
			void set_creation_data(string creation_data);
			//	Метод позволяющий задать значение параметру	_release_data	
			void set_release_data(string release_data);
			//	Метод позволяющий задать значение параметру	_content		
			void set_content(string content);
			//	Метод позволяющий задать значение параметру _count_page		
			void set_count_page(int count_page);

		//============================================================================
		// 2) Получение значений	
		//============================================================================

			//	Метод позволяющий получить значение параметра _id_book		
			int		get_id_book();		
			//	Метод позволяющий получить значение параметра _name
			string	get_name();						
			//	Метод позволяющий получить значение параметра _authors
			string	get_authors();				
			//	Метод позволяющий получить значение параметра _creation_data	
			string	get_creation_data();
			//	Метод позволяющий получить значение параметра _release_data	
			string	get_release_data();
			//	Метод позволяющий получить значение параметра _content		
			string	get_content();		
			//	Метод позволяющий получить значение параметра _count_page
			int		get_count_page();			
	
		// ---------------------------------------------------------------------------

	private:
		// Номер книги в бд
		int _id_Book;
		// Назване книги
		string _Name;
		// Автор(ы) книги
		string _Authors;
		// Дата создания книги
		string _Creation_data;
		// Дата выпуска книги
		string _Release_data;
		// Дата взятия пользователем книги
		string _user_took_the_book_date;
		// Содержание книги
		string _content;
		// Колличество страниц
		int _Count_Page;

};
